# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [2]:
import os

In [1]:
# !PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

In [9]:
%load_ext sql

DB_ENDPOINT = os.environ["PGHOST"]
DB = 'pagila'
DB_USER = os.environ["PGUSER"]
DB_PASSWORD = os.environ["PGPASSWORD"]
DB_PORT = os.environ["PGPORT"]

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

# print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: postgres@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [4]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://postgres:***@localhost:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [5]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://postgres:***@localhost:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [6]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pagila
5 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2017, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2017, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [7]:
%sql DROP TABLE test_table

 * postgresql://postgres:***@localhost:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [8]:
%%sql
INSERT INTO star.dim_date (
     date_key
    ,date, year
    ,quarter
    ,month
    ,day
    ,week
    ,is_weekend
)

SELECT DISTINCT
     (TO_CHAR(payment_date::DATE, 'yyyyMMDD')::integer) AS date_key
    ,date(payment_date) AS date
    ,EXTRACT(year FROM payment_date) AS year
    ,EXTRACT(quarter FROM payment_date) AS quarter
    ,EXTRACT(month FROM payment_date) AS month
    ,EXTRACT(day FROM payment_date) AS day
    ,EXTRACT(week FROM payment_date) AS week
    ,CASE
        WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7)
        THEN true
        ELSE false
    END AS is_weekend
    
FROM
    payment
;

 * postgresql://postgres:***@localhost:5432/pagila
40 rows affected.

[]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [18]:
%%sql
INSERT INTO
    star.dim_customer (
         customer_id --customer
        ,first_name --customer
        ,last_name --customer
        ,email --customer
        ,address --address
        ,address2 --address
        ,district --address
        ,city --city
        ,country --country
        ,postal_code --address
        ,phone --address
        ,active --customer
        ,create_date --customer
        ,start_date
        ,end_date
    )
    
SELECT
     customer.customer_id
    ,INITCAP(customer.first_name)
    ,INITCAP(customer.last_name)
    ,LOWER(customer.email)
    ,address.address
    ,address.address2
    ,address.district
    ,city.city
    ,country.country
    ,address.postal_code
    ,address.phone
    ,customer.active
    ,customer.create_date
    ,now() AS start_date
    ,'99991231' AS end_date
    
FROM
    customer
INNER JOIN
    address
ON
    customer.address_id = address.address_id
INNER JOIN
    city
ON
    address.city_id = city.city_id
INNER JOIN
    country 
ON
    city.country_id = country.country_id
;

 * postgresql://postgres:***@localhost:5432/pagila
599 rows affected.

[]

TODO: Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

In [20]:
%%sql
INSERT INTO
    star.dim_movie (
         film_id --film
        ,title --film
        ,description --film
        ,release_year --film
        ,language --language
        ,original_language --language
        ,rental_duration --film
        ,length --film
        ,rating --film
        ,special_features --film
    )
    
SELECT
     film.film_id
    ,INITCAP(film.title)
    ,film.description
    ,film.release_year
    ,language.name
    ,orig_lang.name
    ,film.rental_duration
    ,film.length
    ,film.rating
    ,film.special_features
    
FROM
    film
INNER JOIN
    language
ON
    film.language_id = language.language_id
LEFT JOIN
    language orig_lang
ON
    film.original_language_id = orig_lang.language_id
;

 * postgresql://postgres:***@localhost:5432/pagila
1000 rows affected.

[]

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [22]:
%%sql

INSERT INTO
    star.dim_store (
         store_id --store
        ,address --address
        ,address2 --address
        ,district --address
        ,city --city
        ,country --country
        ,postal_code --address
        ,manager_first_name --staff
        ,manager_last_name --staff
        ,start_date --calculated
        ,end_date --calculated
    )
    
SELECT
     store.store_id
    ,address.address
    ,address.address2
    ,address.district
    ,city.city
    ,country.country
    ,address.postal_code
    ,staff.first_name
    ,staff.last_name
    ,CURRENT_DATE AS start_date
    ,'99991231' AS end_date

FROM
   store
INNER JOIN
    staff
ON
    store.manager_staff_id = staff.staff_id
INNER JOIN
    address
ON
    store.address_id = address.address_id
INNER JOIN
    city
ON
    address.city_id = city.city_id
INNER JOIN
    country
ON
    city.country_id = country.country_id

 * postgresql://postgres:***@localhost:5432/pagila
2 rows affected.

[]

TODO: Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [27]:
%%sql

INSERT INTO
    star.fact_sales (
         date_key --dim_date
        ,customer_key --dim_customer
        ,movie_key --dim_movie
        ,store_key --dim_store
        ,sales_amount --payment
    )
    
SELECT
     dim_date.date_key
    ,dim_customer.customer_key
    ,dim_movie.movie_key
    ,dim_store.store_key
    ,payment.amount
    
FROM
    public.payment AS payment
    
-- film_id
INNER JOIN
    public.rental AS rental
ON
    payment.rental_id = rental.rental_id
INNER JOIN
    public.inventory AS inventory
ON
    inventory.inventory_id = rental.inventory_id
INNER JOIN
    star.dim_movie AS dim_movie
ON
    dim_movie.film_id = inventory.film_id
    
-- store_id
INNER JOIN
    star.dim_store AS dim_store
ON
    inventory.store_id = dim_store.store_id
    
LEFT JOIN
    star.dim_date AS dim_date
ON
    payment.payment_date::DATE = dim_date.date
LEFT JOIN
    star.dim_customer AS dim_customer
ON
    payment.customer_id = dim_customer.customer_id

 * postgresql://postgres:***@localhost:5432/pagila
16049 rows affected.

[]